| mobo | rog zenith extreme       |  614 |
| cpu  | ryzen threadripper 1950x |  505 |
| gpu  | asus rtx 2080 ti         | 1259 |
| ram  | 16 gb x8                 |      |
| ssd  |                          |      |

- psu: minimum 650w or greater system power supply with two 8-pin pci express supplementary power connectors
- cooling

- nvme / ssd / hdd
- case & cooling
- nvlink

* details

** mobo

- 128 gb ram
- 8 ram slots
- 4 gpu slots

** cpu

- at least 32 PCIe lanes
- at least 4 ram channels

| model                     | core | thread | base | max |   L1 |  L2 | L3 | DDR4 | channel | PCIe |    cost |          |
|---------------------------+------+--------+------+-----+------+-----+----+------+---------+------+---------+----------|
| Ryzen Threadripper 1900X  |    8 |     16 |  3.8 | 4.0 |  768 | 512 | 16 | 2666 | quad    |   64 |  220.31 |   0.1380 |
| Intel Core i9-9900K       |    8 |     16 |  3.6 | 5.0 |      |     |    |      |         |      |  529.00 |   0.0544 |
|---------------------------+------+--------+------+-----+------+-----+----+------+---------+------+---------+----------|
| Ryzen Threadripper 1920X  |   12 |     24 |  3.5 | 4.0 | 1152 | 512 | 32 | 2666 | quad    |   64 |  271.99 |   0.1544 |
| Ryzen Threadripper 2920X  |   12 |     24 |  3.5 | 4.3 | 1152 | 512 | 32 | 2933 | quad    |   64 |  470.38 |   0.0893 |
|---------------------------+------+--------+------+-----+------+-----+----+------+---------+------+---------+----------|
| Ryzen Threadripper 1950X  |   16 |     32 |  3.4 | 4.0 | 1536 | 512 | 32 | 2666 | quad    |   64 |  504.34 |   0.1079 |
| Ryzen Threadripper 2950X  |   16 |     32 |  3.5 | 4.4 | 1536 | 512 | 32 | 2933 | quad    |   64 |  909.22 |   0.0616 |
|---------------------------+------+--------+------+-----+------+-----+----+------+---------+------+---------+----------|
| Ryzen Threadripper 2970WX |   24 |     48 |  3.0 | 4.2 | 2304 | 512 | 64 | 2933 | quad    |   64 |  996.62 |   0.0722 |
| Ryzen Threadripper 3960X  |   24 |     48 |  3.8 | 4.5 |      |     |    |      |         |      |         |  91.2000 |
|---------------------------+------+--------+------+-----+------+-----+----+------+---------+------+---------+----------|
| Ryzen Threadripper 2990WX |   32 |     64 |  3.0 | 4.2 | 3072 | 512 | 64 | 2933 | quad    |   64 | 1866.63 |   0.0514 |
| Ryzen Threadripper 3970X  |   32 |     64 |  3.7 | 4.5 |      |     |    |      |         |      |         | 118.4000 |
#+TBLFM: $13=$2*$4/$12;%.4f
